src/test/resource/Request_XML/67.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Add>
         <tem:a>5</tem:a>
         <tem:b>6</tem:b>
      </tem:Add>
   </soapenv:Body>
</soapenv:Envelope>